tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
# Pack, ship and run any application as a lightweight container
brew "docker"
# X11 image viewer
brew "feh"
# Command-line fuzzy finder written in Go
brew "fzf"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# PNG image optimizing utility
brew "pngquant"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Open-source software for live streaming and screen recording
cask "obs"
# Music streaming service
cask "spotify"
# Active space menu bar icon
cask "whichspace"
